current plan run on central staging

```
Terraform will perform the following actions:

  # module.central-stack.alli_central_application_client_setting.alli-client-settings["saas_membership"] will be updated in-place
  ~ resource "alli_central_application_client_setting" "alli-client-settings" {
      ~ application_id = "e7c4a40c-ac5b-4137-83dc-30ea5946a62d" -> "50af1d47-c264-4165-b047-52649e6609cc"
        id             = "585e68e4-9d6d-457a-b926-e76df8c77d64"
        name           = "central_client_saas_membership"
        # (3 unchanged attributes hidden)
    }

  # module.central-stack.aws_autoscaling_notification.all will be updated in-place
  ~ resource "aws_autoscaling_notification" "all" {
      ~ group_names   = [
          - "centralstaging-bastion-20230512172948005700000001",
          - "centralstaging20230512172948005900000002",
        ] -> (known after apply)
        id            = "arn:aws:sns:us-east-1:002096479106:central-staging-autoscaling"
        # (2 unchanged attributes hidden)
    }

  # module.central-stack.module.bastion.aws_autoscaling_group.bastion must be replaced
+/- resource "aws_autoscaling_group" "bastion" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:002096479106:autoScalingGroup:6982a4ee-e6ae-4615-93f9-34e0075eb9f2:autoScalingGroupName/centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1c",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      ~ launch_configuration      = "centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "centralstaging-bastion-20230512172948005700000001" -> (known after apply) # forces replacement
      ~ name_prefix               = "centralstaging-bastion-" -> (known after apply)
      ~ predicted_capacity        = 0 -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::002096479106:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      ~ warm_pool_size            = 0 -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.central-stack.module.bastion.aws_launch_configuration.bastion must be replaced
+/- resource "aws_launch_configuration" "bastion" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:002096479106:launchConfiguration:c958ae80-3087-4809-8532-09b2a0c58670:launchConfigurationName/centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      ~ image_id                         = "ami-000d217397f5d4251" -> "ami-0f71b045ca63d9ac4" # forces replacement
      ~ name                             = "centralstaging-bastion-20230512172948005700000001" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.central-stack.module.ecs.aws_autoscaling_group.ecs[0] must be replaced
+/- resource "aws_autoscaling_group" "ecs" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:002096479106:autoScalingGroup:51f40433-7539-41d2-bac1-4214aca6c550:autoScalingGroupName/centralstaging20230512172948005900000002" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - default_instance_warmup   = 0 -> null
      ~ desired_capacity          = 0 -> (known after apply)
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "centralstaging20230512172948005900000002" -> (known after apply)
      ~ launch_configuration      = "centralstaging20230512172948005900000002" -> (known after apply)
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "centralstaging20230512172948005900000002" -> (known after apply) # forces replacement
      ~ name_prefix               = "centralstaging" -> (known after apply)
      ~ predicted_capacity        = 0 -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::002096479106:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      ~ warm_pool_size            = 0 -> (known after apply)
        # (10 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # module.central-stack.module.ecs.aws_cloudwatch_event_target.check-ecs-tasks will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "check-ecs-tasks" {
      ~ arn            = "arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply)
        id             = "check-ecs-tasks-central-staging-ai7c-check-ecs-tasks-central-staging-ai7c"
        # (3 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_iam_policy.ecs-drain-lambda has moved to module.central-stack.module.ecs.aws_iam_policy.ecs-drain-lambda[0]
    resource "aws_iam_policy" "ecs-drain-lambda" {
        id          = "arn:aws:iam::002096479106:policy/ecs-drain-central-staging-bI4s"
        name        = "ecs-drain-central-staging-bI4s"
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_iam_role.ecs-drain has moved to module.central-stack.module.ecs.aws_iam_role.ecs-drain[0]
    resource "aws_iam_role" "ecs-drain" {
        id                    = "ECSDrain@central-staging-bI4s"
        name                  = "ECSDrain@central-staging-bI4s"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.central-stack.module.ecs.aws_iam_role_policy.check-ecs-tasks-perms must be replaced
-/+ resource "aws_iam_role_policy" "check-ecs-tasks-perms" {
      ~ id     = "lambda@check-ecs-tasks-central-staging-ai7cfebU:check-ecs-tasks-central-staging-ai7c" -> (known after apply)
        name   = "check-ecs-tasks-central-staging-ai7c"
      ~ policy = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = "sns:Publish"
                        Effect   = "Allow"
                        Resource = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
                        Sid      = "AllowPublishSNS"
                    },
                    {
                        Action   = [
                            "ecs:ListTasks",
                            "ecs:ListTaskDefinitionFamilies",
                            "ecs:DescribeTasks",
                            "ecs:DescribeTaskDefinition",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "AllowECSPermissions"
                    },
                    {
                        Action   = [
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:us-east-1:002096479106:table/check-ecs-tasks-central-staging-ai7c"
                        Sid      = "AllowDynamoAccess"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ role   = "lambda@check-ecs-tasks-central-staging-ai7cfebU" -> "check-ecs-tasks-central-staging-ai7c" # forces replacement
    }

  # module.central-stack.module.ecs.aws_iam_role_policy_attachment.ecs-drain has moved to module.central-stack.module.ecs.aws_iam_role_policy_attachment.ecs-drain[0]
    resource "aws_iam_role_policy_attachment" "ecs-drain" {
        id         = "ECSDrain@central-staging-bI4s-20201012222756848000000003"
        # (2 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_iam_role_policy_attachment.ecs-drain-lambda[0] must be replaced
  # (moved from module.central-stack.module.ecs.aws_iam_role_policy_attachment.ecs-drain-lambda)
-/+ resource "aws_iam_role_policy_attachment" "ecs-drain-lambda" {
      ~ id         = "lambda@ecs-drain-central-staging-bI4s9uUd-20201012222801908500000004" -> (known after apply)
      ~ role       = "lambda@ecs-drain-central-staging-bI4s9uUd" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.central-stack.module.ecs.aws_lambda_permission.check-ecs-tasks must be replaced
-/+ resource "aws_lambda_permission" "check-ecs-tasks" {
      ~ function_name       = "arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply) # forces replacement
      ~ id                  = "AllowExecutionFromCloudWatch" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_lambda_permission.ecs-drain[0] must be replaced
  # (moved from module.central-stack.module.ecs.aws_lambda_permission.ecs-drain)
-/+ resource "aws_lambda_permission" "ecs-drain" {
      ~ function_name       = "arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd" -> (known after apply) # forces replacement
      ~ id                  = "ECSDrain" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_launch_configuration.ecs[0] must be replaced
+/- resource "aws_launch_configuration" "ecs" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:002096479106:launchConfiguration:8808ffaa-8715-4e5d-9278-7832c38ce6bc:launchConfigurationName/centralstaging20230512172948005900000002" -> (known after apply)
      ~ associate_public_ip_address      = false -> (known after apply)
      ~ id                               = "centralstaging20230512172948005900000002" -> (known after apply)
      ~ image_id                         = "ami-0646176e423ec9408" -> "ami-0d5f95d7bbeae0869" # forces replacement
      ~ name                             = "centralstaging20230512172948005900000002" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true # forces replacement
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = 30 # forces replacement
          + volume_type           = "gp2" # forces replacement
        }
    }

  # module.central-stack.module.ecs.aws_s3_bucket.lambda-builds will be created
  + resource "aws_s3_bucket" "lambda-builds" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "check-ecs-tasks-central-staging-ai7c-lambda-builds"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.central-stack.module.ecs.aws_sns_topic.ecs-drain has moved to module.central-stack.module.ecs.aws_sns_topic.ecs-drain[0]
    resource "aws_sns_topic" "ecs-drain" {
        id                                       = "arn:aws:sns:us-east-1:002096479106:central-staging-ecs-drain"
        name                                     = "central-staging-ecs-drain"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.aws_sns_topic_subscription.ecs-drain[0] must be replaced
  # (moved from module.central-stack.module.ecs.aws_sns_topic_subscription.ecs-drain)
-/+ resource "aws_sns_topic_subscription" "ecs-drain" {
      ~ arn                             = "arn:aws:sns:us-east-1:002096479106:central-staging-ecs-drain:3c46e9c1-9cd9-471b-94ee-04b4fcc7a45f" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd" -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:002096479106:central-staging-ecs-drain:3c46e9c1-9cd9-471b-94ee-04b4fcc7a45f" -> (known after apply)
      ~ owner_id                        = "002096479106" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.random_string.drain-task-rando has moved to module.central-stack.module.ecs.random_string.drain-task-rando[0]
    resource "random_string" "drain-task-rando" {
        id          = "bI4s"
        # (11 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.random_string.dynamo-table will be destroyed
  # (because random_string.dynamo-table is not in configuration)
  - resource "random_string" "dynamo-table" {
      - id          = "gYf3" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "gYf3" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.central-stack.module.lambda-alliclientcreds-s3-tagging.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "alliclientcreds-staging-s3-taggingK5Mr"
      ~ last_modified                  = "2023-05-03T14:56:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "cGpnouX+j2nZAXc/5YneDd61160nEEqIssFat7oVs2E=" -> "WSEDSZWFxhEFQ5oL0CJuOg3M/hNXkpbbzwbQ8HtovqU="
        tags                           = {}
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.central-stack.module.lambda-alliclientcreds-s3-tagging.aws_s3_bucket_object.artifact will be updated in-place
  ~ resource "aws_s3_bucket_object" "artifact" {
      ~ etag                   = "3cbe6629a4745da76faa56d410af233a-6" -> "5b0824d440e5585226a6083353f2d5ff"
        id                     = "alliclientcreds-staging-s3-taggingK5Mr.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.central-stack.module.lambda-allievents-client-file-events.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "allievents-staging-client-file-events3HwR"
      ~ last_modified                  = "2023-05-03T14:56:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "uHXcx6thdlJl01SzGKP4qyIDvUgHdG5mlPHfs244rE0=" -> "1E1pV6dHtQHZ7B0CF51BDhvoq7++5PYkyXeb7FhGkbA="
        tags                           = {}
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.central-stack.module.lambda-allievents-client-file-events.aws_s3_bucket_object.artifact will be updated in-place
  ~ resource "aws_s3_bucket_object" "artifact" {
      ~ etag                   = "08ad22f7789cf5ac16fb46f2ef7affa5-6" -> "0a879905dab1d343797da57fcf916b4a"
        id                     = "allievents-staging-client-file-events3HwR.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_cloudwatch_log_group.lambda[0] must be replaced
  # (moved from module.central-stack.module.ecs.module.check-ecs-tasks.aws_cloudwatch_log_group.lambda)
-/+ resource "aws_cloudwatch_log_group" "lambda" {
      ~ arn               = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply)
      ~ id                = "/aws/lambda/check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply)
      ~ name              = "/aws/lambda/check-ecs-tasks-central-staging-ai7cfebU" -> "/aws/lambda/check-ecs-tasks-central-staging-ai7c" # forces replacement
      + name_prefix       = (known after apply)
      ~ retention_in_days = 7 -> 0
      + skip_destroy      = false
      ~ tags              = {
          - "Application"   = "central-ai7c" -> null
          + "CLUSTER_NAME"  = "centralstaging"
          - "Environment"   = "staging" -> null
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      ~ tags_all          = {
          - "Application"   = "central-ai7c" -> null
          + "CLUSTER_NAME"  = "centralstaging"
          - "Environment"   = "staging" -> null
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "check-ecs-tasks-central-staging-ai7c-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + tags_all    = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_policy.vpc[0] will be created
  + resource "aws_iam_policy" "vpc" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "check-ecs-tasks-central-staging-ai7c-vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:UnassignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + tags_all    = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_role.lambda[0] must be replaced
  # (moved from module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_role.lambda)
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::002096479106:role/lambda@check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-10-12T22:27:58Z" -> (known after apply)
      ~ force_detach_policies = false -> true
      ~ id                    = "lambda@check-ecs-tasks-central-staging-ai7cfebU" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "lambda@check-ecs-tasks-central-staging-ai7cfebU" -> "check-ecs-tasks-central-staging-ai7c" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = "2023-06-09T21:38:12Z"
              - region         = "us-east-1"
            },
        ] -> (known after apply)
      ~ tags                  = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      ~ tags_all              = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      ~ unique_id             = "AROAQA7HVXOBGCREHQAGF" -> (known after apply)
        # (2 unchanged attributes hidden)

      - inline_policy {
          - name   = "check-ecs-tasks-central-staging-ai7c" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "sns:Publish"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
                          - Sid      = "AllowPublishSNS"
                        },
                      - {
                          - Action   = [
                              - "ecs:ListTasks",
                              - "ecs:ListTaskDefinitionFamilies",
                              - "ecs:DescribeTasks",
                              - "ecs:DescribeTaskDefinition",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "AllowECSPermissions"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:us-east-1:002096479106:table/check-ecs-tasks-central-staging-ai7c"
                          - Sid      = "AllowDynamoAccess"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "check-ecs-tasks-central-staging-ai7cfebU@central-ai7cstaging" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::lambda-central-ai7cstaging:check-ecs-tasks-central-staging-ai7cfebU.zip"
                          - Sid      = ""
                        },
                      - {
                          - Action   = [
                              - "ec2:DescribeVpcs",
                              - "ec2:DescribeSubnets",
                              - "ec2:DescribeSecurityGroups",
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DescribeDhcpOptions",
                              - "ec2:DeleteNetworkInterface",
                              - "ec2:CreateNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "AllowEC2Network"
                        },
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/check-ecs-tasks-central-staging-ai7cfebU:*"
                          - Sid      = "AllowCloudwatchLogs"
                        },
                      - {
                          - Action   = "cloudwatch:PutMetricData"
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "AllowCloudwatchMetrics"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_role_policy.lambda will be destroyed
  # (because aws_iam_role_policy.lambda is not in configuration)
  - resource "aws_iam_role_policy" "lambda" {
      - id     = "lambda@check-ecs-tasks-central-staging-ai7cfebU:check-ecs-tasks-central-staging-ai7cfebU@central-ai7cstaging" -> null
      - name   = "check-ecs-tasks-central-staging-ai7cfebU@central-ai7cstaging" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::lambda-central-ai7cstaging:check-ecs-tasks-central-staging-ai7cfebU.zip"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeDhcpOptions",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowEC2Network"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/check-ecs-tasks-central-staging-ai7cfebU:*"
                      - Sid      = "AllowCloudwatchLogs"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowCloudwatchMetrics"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "lambda@check-ecs-tasks-central-staging-ai7cfebU" -> null
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "check-ecs-tasks-central-staging-ai7c"
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_iam_role_policy_attachment.vpc[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "check-ecs-tasks-central-staging-ai7c"
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_lambda_function.main will be destroyed
  # (because aws_lambda_function.main is not in configuration)
  - resource "aws_lambda_function" "main" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU" -> null
      - function_name                  = "check-ecs-tasks-central-staging-ai7cfebU" -> null
      - handler                        = "main.handle" -> null
      - id                             = "check-ecs-tasks-central-staging-ai7cfebU" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU/invocations" -> null
      - last_modified                  = "2023-05-03T14:56:08.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:002096479106:function:check-ecs-tasks-central-staging-ai7cfebU:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::002096479106:role/lambda@check-ecs-tasks-central-staging-ai7cfebU" -> null
      - runtime                        = "python3.7" -> null
      - s3_bucket                      = "lambda-central-ai7cstaging" -> null
      - s3_key                         = "check-ecs-tasks-central-staging-ai7cfebU.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "RGlFlMvJEUmrl57RRuHKO7VMCtc37/Nd++6wXYjT4W4=" -> null
      - source_code_size               = 1364 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CLUSTER_NAME"  = "centralstaging"
              - "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0d50956abfe5243d1",
            ] -> null
          - subnet_ids         = [
              - "subnet-098e456bdef08a6de",
              - "subnet-0f327f735b06b2884",
            ] -> null
          - vpc_id             = "vpc-0dd362d834b785091" -> null
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "check-ecs-tasks-central-staging-ai7c"
      + handler                        = "main.handle"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.zip"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + tags_all                       = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0d50956abfe5243d1",
            ]
          + subnet_ids         = [
              + "subnet-098e456bdef08a6de",
              + "subnet-0f327f735b06b2884",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_lambda_permission.current_version_triggers["ScheduledEvent"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "check-ecs-tasks-central-staging-ai7c"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + statement_id        = "ScheduledEvent"
      + statement_id_prefix = (known after apply)
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_lambda_permission.unqualified_alias_triggers["ScheduledEvent"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "check-ecs-tasks-central-staging-ai7c"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + statement_id        = "ScheduledEvent"
      + statement_id_prefix = (known after apply)
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_s3_bucket.lambda will be destroyed
  # (because aws_s3_bucket.lambda is not in configuration)
  - resource "aws_s3_bucket" "lambda" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::lambda-central-ai7cstaging" -> null
      - bucket                      = "lambda-central-ai7cstaging" -> null
      - bucket_domain_name          = "lambda-central-ai7cstaging.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "lambda-central-ai7cstaging.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "lambda-central-ai7cstaging" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "416c4c7efe81bf1edca48477885a44fef5b9fc91c08a9a69a57fff99b9e71ac1" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_s3_bucket_object.artifact will be destroyed
  # (because aws_s3_bucket_object.artifact is not in configuration)
  - resource "aws_s3_bucket_object" "artifact" {
      - acl                    = "private" -> null
      - bucket                 = "lambda-central-ai7cstaging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "5625417799506a8da36df3d311b7e436" -> null
      - force_destroy          = false -> null
      - id                     = "check-ecs-tasks-central-staging-ai7cfebU.zip" -> null
      - key                    = "check-ecs-tasks-central-staging-ai7cfebU.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/2144865577036156450/check-ecs-tasks-central-staging-ai7cfebU.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.aws_s3_bucket_object.lambda_package[0] will be created
  + resource "aws_s3_bucket_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.zip"
      + storage_class          = "ONEZONE_IA"
      + tags                   = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + tags_all               = {
          + "CLUSTER_NAME"  = "centralstaging"
          + "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-1:002096479106:check-ecs-tasks-central-staging-ai7c"
          + "Terraform"     = "true"
        }
      + version_id             = (known after apply)
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../../../terraform-ecscluster/check_tasks/",
                      + null,
                    ],
                ]
              + filename      = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.zip"
              + runtime       = "python3.7"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.plan.json"
      + id                   = (known after apply)
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/4a69933996ade507a3bd01b96d79bbb0024cf8d297709911f5796f0ecec32cea.zip"
          + "timestamp" = "<WARNING: Missing lambda zip artifacts wouldn't be restored>"
        }
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.null_resource.build will be destroyed
  # (because null_resource.build is not in configuration)
  - resource "null_resource" "build" {
      - id       = "2144865577036156450" -> null
      - triggers = {
          - "function_version" = "6547d4c124ff17056e5672aed6643231"
        } -> null
    }

  # module.central-stack.module.ecs.module.check-ecs-tasks.random_string.rando will be destroyed
  # (because random_string.rando is not in configuration)
  - resource "random_string" "rando" {
      - id          = "febU" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "febU" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_cloudwatch_log_group.lambda will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/ecs-drain-central-staging-bI4s9uUd" -> null
      - id                = "/aws/lambda/ecs-drain-central-staging-bI4s9uUd" -> null
      - name              = "/aws/lambda/ecs-drain-central-staging-bI4s9uUd" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "Application" = "ecs-drain-central-staging-bI4s"
          - "Environment" = "staging"
        } -> null
      - tags_all          = {
          - "Application" = "ecs-drain-central-staging-bI4s"
          - "Environment" = "staging"
        } -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_iam_role.lambda will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::002096479106:role/lambda@ecs-drain-central-staging-bI4s9uUd" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2020-10-12T22:28:00Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda@ecs-drain-central-staging-bI4s9uUd" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::002096479106:policy/ecs-drain-central-staging-bI4s",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda@ecs-drain-central-staging-bI4s9uUd" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-05-12T17:34:51Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQA7HVXOBODLRMRRM7" -> null

      - inline_policy {
          - name   = "ecs-drain-central-staging-bI4s9uUd@ecs-drain-central-staging-bI4sstaging" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::lambda-ecs-drain-central-staging-bi4sstaging:ecs-drain-central-staging-bI4s9uUd.zip"
                          - Sid      = ""
                        },
                      - {
                          - Action   = [
                              - "ec2:DescribeVpcs",
                              - "ec2:DescribeSubnets",
                              - "ec2:DescribeSecurityGroups",
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DescribeDhcpOptions",
                              - "ec2:DeleteNetworkInterface",
                              - "ec2:CreateNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "AllowEC2Network"
                        },
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/ecs-drain-central-staging-bI4s9uUd:*"
                          - Sid      = "AllowCloudwatchLogs"
                        },
                      - {
                          - Action   = "cloudwatch:PutMetricData"
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "AllowCloudwatchMetrics"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_iam_role_policy.lambda will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_iam_role_policy" "lambda" {
      - id     = "lambda@ecs-drain-central-staging-bI4s9uUd:ecs-drain-central-staging-bI4s9uUd@ecs-drain-central-staging-bI4sstaging" -> null
      - name   = "ecs-drain-central-staging-bI4s9uUd@ecs-drain-central-staging-bI4sstaging" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::lambda-ecs-drain-central-staging-bi4sstaging:ecs-drain-central-staging-bI4s9uUd.zip"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeDhcpOptions",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowEC2Network"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:002096479106:log-group:/aws/lambda/ecs-drain-central-staging-bI4s9uUd:*"
                      - Sid      = "AllowCloudwatchLogs"
                    },
                  - {
                      - Action   = "cloudwatch:PutMetricData"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowCloudwatchMetrics"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "lambda@ecs-drain-central-staging-bI4s9uUd" -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_lambda_function.main will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_lambda_function" "main" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd" -> null
      - function_name                  = "ecs-drain-central-staging-bI4s9uUd" -> null
      - handler                        = "main.handle" -> null
      - id                             = "ecs-drain-central-staging-bI4s9uUd" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd/invocations" -> null
      - last_modified                  = "2023-05-03T14:56:07.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:002096479106:function:ecs-drain-central-staging-bI4s9uUd:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::002096479106:role/lambda@ecs-drain-central-staging-bI4s9uUd" -> null
      - runtime                        = "python3.7" -> null
      - s3_bucket                      = "lambda-ecs-drain-central-staging-bi4sstaging" -> null
      - s3_key                         = "ecs-drain-central-staging-bI4s9uUd.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "YImhpdZfnaL4tWkq3Q6gk+fTz6qWgWMA1YlF7P/syCw=" -> null
      - source_code_size               = 1209 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 120 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CLUSTER_NAME" = "centralstaging"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0d50956abfe5243d1",
            ] -> null
          - subnet_ids         = [
              - "subnet-098e456bdef08a6de",
              - "subnet-0f327f735b06b2884",
            ] -> null
          - vpc_id             = "vpc-0dd362d834b785091" -> null
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_s3_bucket.lambda will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_s3_bucket" "lambda" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::lambda-ecs-drain-central-staging-bi4sstaging" -> null
      - bucket                      = "lambda-ecs-drain-central-staging-bi4sstaging" -> null
      - bucket_domain_name          = "lambda-ecs-drain-central-staging-bi4sstaging.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "lambda-ecs-drain-central-staging-bi4sstaging.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "lambda-ecs-drain-central-staging-bi4sstaging" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "416c4c7efe81bf1edca48477885a44fef5b9fc91c08a9a69a57fff99b9e71ac1" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain.aws_s3_bucket_object.artifact will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "aws_s3_bucket_object" "artifact" {
      - acl                    = "private" -> null
      - bucket                 = "lambda-ecs-drain-central-staging-bi4sstaging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "3e6a415e19f0685290cc80e36290b9b7" -> null
      - force_destroy          = false -> null
      - id                     = "ecs-drain-central-staging-bI4s9uUd.zip" -> null
      - key                    = "ecs-drain-central-staging-bI4s9uUd.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/tmp/209074744955688894/ecs-drain-central-staging-bI4s9uUd.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain.null_resource.build will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "null_resource" "build" {
      - id       = "209074744955688894" -> null
      - triggers = {
          - "function_version" = "b74899ceff4492def31013003d652451"
        } -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain.random_string.rando will be destroyed
  # (because module.central-stack.module.ecs.module.ecs-drain is not in configuration)
  - resource "random_string" "rando" {
      - id          = "9uUd" -> null
      - length      = 4 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "9uUd" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].data.archive_file.artifact will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "artifact" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../../terraform-ecscluster/ecs_drain"
      + type                = "zip"
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].data.aws_iam_policy_document.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeDhcpOptions",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeVpcs",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowEC2Network"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudwatchLogs"
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowCloudwatchMetrics"
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Application" = "ecs-drain-central-staging-bI4s"
          + "Environment" = "staging"
        }
      + tags_all          = {
          + "Application" = "ecs-drain-central-staging-bI4s"
          + "Environment" = "staging"
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_iam_role_policy.lambda will be created
  + resource "aws_iam_role_policy" "lambda" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.handle"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 120
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CLUSTER_NAME" = "centralstaging"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0d50956abfe5243d1",
            ]
          + subnet_ids         = [
              + "subnet-098e456bdef08a6de",
              + "subnet-0f327f735b06b2884",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_s3_bucket.lambda will be created
  + resource "aws_s3_bucket" "lambda" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "lambda-ecs-drain-central-staging-bi4sstaging"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].aws_s3_bucket_object.artifact will be created
  + resource "aws_s3_bucket_object" "artifact" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].null_resource.build will be created
  + resource "null_resource" "build" {
      + id       = (known after apply)
      + triggers = {
          + "function_version" = "b74899ceff4492def31013003d652451"
        }
    }

  # module.central-stack.module.ecs.module.ecs-drain[0].random_string.rando will be created
  + resource "random_string" "rando" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.central-stack.module.sftp-transfer.module.idp-lamda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/23195955adaa0f2c29d52bd1a26c7e8fe568d9363992e6280c5ff994c322bdb9.zip" -> "builds/36abac0781763ef8d02f8169e6fa2cee5161c1dbf3466076e04cff264ee379c3.zip"
        id                             = "sftp-transfer-staging-identity-provider"
      ~ last_modified                  = "2023-05-03T14:56:09.000+0000" -> (known after apply)
        tags                           = {
            "Application" = "sftp-transfer"
            "Environment" = "staging"
        }
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.central-stack.module.sftp-transfer.module.idp-lamda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.9",
                      + "../../modules/sftp-transfer/identity-provider-lambda/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "../../modules/sftp-transfer/identity-provider-lambda",
                      + null,
                    ],
                ]
              + filename      = "builds/36abac0781763ef8d02f8169e6fa2cee5161c1dbf3466076e04cff264ee379c3.zip"
              + runtime       = "python3.9"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/36abac0781763ef8d02f8169e6fa2cee5161c1dbf3466076e04cff264ee379c3.plan.json"
      + id                   = (known after apply)
    }

  # module.central-stack.module.sftp-transfer.module.idp-lamda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4914245697077480690" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23195955adaa0f2c29d52bd1a26c7e8fe568d9363992e6280c5ff994c322bdb9.zip" -> "builds/36abac0781763ef8d02f8169e6fa2cee5161c1dbf3466076e04cff264ee379c3.zip"
            # (1 unchanged element hidden)
        }
    }

  # module.central-stack.module.sftp-transfer.module.idp-lamda.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3137378429776025846" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/23195955adaa0f2c29d52bd1a26c7e8fe568d9363992e6280c5ff994c322bdb9.zip" -> "builds/36abac0781763ef8d02f8169e6fa2cee5161c1dbf3466076e04cff264ee379c3.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 33 to add, 8 to change, 28 to destroy.
```